Revit 2026 API

# MechanicalEquipmentSetAreElementsNotConnectedInSeries Method

---
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreElementsNotConnectedInSeries(
	Document document,
	ISet<ElementId> elemIds
)
```
```vb
Public Shared Function AreElementsNotConnectedInSeries (
	document As Document,
	elemIds As ISet(Of ElementId)
) As Boolean
```
```cpp
public:
static bool AreElementsNotConnectedInSeries(
	Document^ document,
	ISet<ElementId^>^ elemIds
)
```
```fsharp
static member AreElementsNotConnectedInSeries :
        document : Document *
        elemIds : ISet<ElementId> -> bool
```

#### Parameters

document Document

elemIds ISetElementId

#### Return Value

Boolean

#### Reference

MechanicalEquipmentSet Class

Autodesk.Revit.DB.Mechanical Namespace